{
  "posts": [
    {
      "id": 1,
      "title": "gta 5",
      "author": "michael",
      "date_time": "19 JULY 2018, 11:00PM",
      "content": "Grand Theft Auto V is an action-adventure video game developed by Rockstar North and published by Rockstar Games It was released in September 2013 for PlayStation 3 and Xbox 360 in November 2014 for PlayStation 4 and Xbox One and in April 2015 for Microsoft Windows It is the first main entry in the Grand Theft Auto series since 2008s Grand Theft Auto IV Set within the fictional state of San Andreas based on Southern California the single-player story follows three criminals and their efforts to commit heists while under pressure from a government agency The open world design lets players freely roam San Andreas open countryside and the fictional city of Los Santos based on Los Angeles

    The game is played from either a third-person or first-person perspective and its world is navigated on foot or by vehicle. Players control the three lead protagonists throughout single-player and switch between them both during and outside missions. The story is centred on the heist sequences and many missions involve shooting and driving gameplay. A wanted system governs the aggression of law enforcement response to players who commit crimes. Grand Theft Auto Online the games online multiplayer mode lets up to 30 players engage in a variety of different cooperative and competitive game modes.

    The development of Grand Theft Auto V began soon after Grand Theft Auto IV's release and was shared between many of Rockstar's studios worldwide. The development team drew influence from many of their previous projects such as Red Dead Redemption and Max Payne 3 and designed the game around three lead protagonists to innovate on the core structure of its predecessors. Much of the development work constituted the open world's creation and several team members conducted field research around California to capture footage for the design team. The game's soundtrack features an original score composed by a team of producers who collaborated over several years.

    Extensively marketed and widely anticipated the game broke industry sales records and became the fastest-selling entertainment product in history earning $800 million in its first day and $1 billion in its first three days. It received widespread critical acclaim with praise directed at its multiple protagonist design open world presentation and gameplay. However it caused controversies related to its depiction of women and a mission featuring torture during a hostage interrogation. Considered one of seventh generation console gaming's most significant titles and among the best games ever made it won year-end accolades including Game of the Year awards from several gaming publications. It is the third best-selling video game of all time with over 95 million copies shipped and is one of the most financially successful entertainment products of all time with over $6 billion in worldwide revenue"
    },
    {
      "id": 2,
      "title": "need for speed carbon",
      "author": "michael",
      "date_time": " 20 JULY 2018, 1:55PM",
      "content": "Need for Speed: Carbon is a 2006 racing video game published by Electronic Arts. It is the tenth installment in the Need for Speed series and a sequel to Need for Speed: Most Wanted. It was followed by Need for Speed: Prostreet in the following year

The PlayStation Portable Nintendo DS and Game Boy Advance versions of the game are called Need for Speed: Carbon – Own the City set in a fictional city named Coast City with a significantly different storyline and also featuring different AI teammate abilities.[2] In 2009 a version of Own the City was also released on the Zeebo as a pre-installed game"
    },
    {
      "id": 3,
      "title": "god of war",
      "author": "michael",
      "date_time": "20 JULY 2018, 2:35PM",
      "content": "God of War is a mythology-based action-adventure hack and slash video game franchise. Created by David Jaffe at Sony's Santa Monica Studio, the series debuted in 2005 on the PlayStation 2 (PS2) video game console, and has become a flagship title for the PlayStation brand, consisting of eight games across multiple platforms. The story is about Kratos, a Spartan warrior tricked into killing his wife and daughter by his former master, the Greek God of War Ares. Kratos kills Ares and becomes the new God of War, but is still haunted by the nightmares of his past. Revealed to be the son of Zeus, who later betrays Kratos, the Spartan then seeks revenge against the Olympian gods for their machinations. After destroying the Greek pantheon, Kratos ends up in the world of the Norse gods. He and his young son, Atreus, set out on a journey to fulfill his recently deceased second wife's last wish, which is to spread her ashes at the highest peak of the nine realms."
    },
    {
      "id": 4,
      "title": "mortal kombat X",
      "author": "michael",
      "date_time": "18 JULY 2018, 10:13AM",
      "content": ""
    },
    {
      "id": 5,
      "title": "pes 2018",
      "author": "michael",
      "date_time": "19 JULY 2018, 10:30PM",
      "content": ""
    },
    {
      "id": 6,
      "title": "fifa 2018",
      "author": "michael",
      "date_time": "13 JULY 2018, 9:25PM",
      "content": ""
    },
    {
      "id": 7,
      "title": "assasins creed origins",
      "author": "michael",
      "date_time": "19 JULY 2018, 8:52PM",
      "content": "Assassin's Creed Origins is an action-adventure video game developed by Ubisoft Montreal and published by Ubisoft. It is the tenth major installment in the Assassin's Creed series and the successor to 2015's Assassin's Creed Syndicate. It was released worldwide for Microsoft Windows, PlayStation 4, and Xbox One on October 27, 2017. The game is set in Egypt near the end of the Ptolemaic period (49–47 BC) and recounts the secret fictional history of real-world events. The story follows a Medjay named Bayek, and explores the origins of the centuries-long conflict between the Brotherhood of Assassins, who fight for peace by promoting liberty, and The Order of the Ancients—forerunners to the Templar Order—who desire peace through the forced imposition of order.

Origins received positive reviews from critics who praised the story characters voice acting reworked gameplay-systems immersive world of Egypt and the visuals while criticizing some of the pacing and technical issues. The game will be followed by Assassin's Creed Odyssey which takes place in Ancient Greece and is scheduled to be released in October 2018"
    },
    {
      "id": 8,
      "title": "call of duty modern wafare 3",
      "author": "michael",
      "date_time": "14 JULY 2018, 00:01AM",
      "content": "Call of Duty Modern Warfare 3 (stylized as Call of Duty MW3) is a first-person shooter video game developed by Infinity Ward and Sledgehammer Games with assistance from Raven Software and published by Activision The game was released worldwide in November 2011 for Microsoft Windows the Xbox 360 PlayStation 3 and Wii It is the third installment in the Modern Warfare saga a direct sequel to 2009s Call of Duty: Modern Warfare 2 and the eighth Call of Duty installment A separate version for the Nintendo DS was developed by n-Space while Treyarch developed the games Wii port In Japan Square Enix published the game with a separate subtitled and dubbed version

The games campaign follows Modern Warfare 2 and begins right after the events of its final mission. Similar to Modern Warfare 2 it is centered around the Task Force 141 which contains Captain Price Soap MacTavish and Yuri one of the playable characters. Alongside the Delta Force and Special Air Service they hunt Vladimir Makarov (antagonist of Modern Warfare 2) a Russian terrorist who leads the Russian Ultranationalist party. He leads several terror attacks across Europe triggering a large-scale war between the Ultranationalists and friendly forces. For the game's multiplayer mode new mode types and killstreak choices were brought in. Improvements were also made to the mode that solved issues that appeared in Modern Warfare 2

Using an enhanced version of Modern Warfare 2's IW engine development for the game began in 2010 with more than one developer. Prior to development Infinity Ward co-founders Jason West and Vince Zampella left the company to form Respawn Entertainment. Other members had been fired or had left the company following the duo's departure. Sledgehammer Games had joined the Modern Warfare 3 development force with Raven Software also developing the game's multiplayer mode. Following a large leak containing detailed information about the game multiple teaser trailers were released with each showcasing a location featured in the game's campaign leading up to a full reveal.

Modern Warfare 3 received positive reviews from critics. It won the award for Best Shooter at the 2011 Spike Video Game Awards. It was also a massive commercial success. Within 24 hours of going on sale the game sold 6.5 million copies in the United States and United Kingdom and grossed $400 million making it the biggest entertainment launch of all time.[7][8][9]"
    },
    {
      "id": 9,
      "title": "halo 3",
      "author": "michael",
      "date_time": "15 JUNE 2018, 2:40PM",
      "content": "
Halo 3 is a 2007 first-person shooter video game developed by Bungie for the Xbox 360 console. The third installment in the Halo franchise the game concludes the story arc begun in 2001's Halo Combat Evolved and continued in 2004 Halo 2. The game was released on September 25 2007 in Australia Brazil India New Zealand North America and Singapore September 26 2007 in Europe and September 27 2007 in Japan. Halo 3 story centers on the interstellar war between twenty-sixth century humanity and a collection of alien races known as the Covenant. The player assumes the role of the Master Chief a cybernetically enhanced supersoldier as he battles the Covenant. The game features vehicles weapons and gameplay elements not present in previous titles of the series as well as the addition of saved gameplay films file sharing and the Forge map editor—a utility which allows the player to perform modifications to multiplayer levels.

Bungie began developing Halo 3 shortly after Halo 2 shipped. The game was officially announced at E3 2006 and its release was preceded by a multiplayer beta open to select players who purchased the Xbox 360 game Crackdown. Microsoft spent 40 million on marketing the game in an effort to sell more game consoles and broaden the appeal of the game beyond the established Halo fanbase. Marketing included cross-promotions and an alternate reality game.

On the day before its official release 42 million units of Halo 3 were in retail outlets. Halo 3 grossed US$300 million in its first week. More than one million people played Halo 3 on Xbox Live in the first twenty hours. To date Halo 3 has sold in excess of 14.5 million copies making it the fifth best selling Xbox 360 game of all time the best selling Xbox 360 exclusive title and the best selling first person shooter on the console outside of the Call of Duty games. The game was also the best-selling video game of 2007 in the US Overall the game was very well received by critics with the Forge and multiplayer offerings singled out as strong features however some reviewers criticized singleplayer aspects especially the plot and campaign layout. A prequel to the game Halo 3 ODST was released worldwide on September 22 2009. A sequel Halo 4 released on November 6 2012 was developed by 343 Industries and grossed $220 million on its launch day. Halo 3 was rereleased as part of Halo The Master Chief Collection for the Xbox One on November 11 2014"
    },
    {
      "title": "nml][;b]'",
      "author": "]\\ fghb]nj'k",
      "date_time": "=\\n4jknkl",
      "content": "<p>u][n'jkm;']</p><p><br></p>",
      "id": 10
    },
    {
      "title": "gfdsgvfdfgb",
      "author": "vdsfgvdf",
      "date_time": "hghf",
      "content": "<p>gfdgvbdb</p>",
      "id": 11
    }
  ]
}
